app/views/sub_reddits/show.html.erb

  </thead>
  <% if @sub_reddit.related_sub_reddits.first && @sub_reddit.related_sub_reddits.count > 0 %>
    <tbody>
      <% @sub_reddit.related_sub_reddits.order(:weight).reverse.each do |related_sub_reddit| %>
---
SELECT  "related_sub_reddits".* FROM "related_sub_reddits" WHERE "related_sub_reddits"."sub_reddit_id" = ?  ORDER BY "related_sub_reddits"."id" ASC LIMIT 1  [["sub_reddit_id", 13]]
SELECT COUNT(*) FROM "related_sub_reddits" WHERE "related_sub_reddits"."sub_reddit_id" = ?  [["sub_reddit_id", 14]]
SELECT "related_sub_reddits".* FROM "related_sub_reddits" WHERE "related_sub_reddits"."sub_reddit_id" = ?  ORDER BY "related_sub_reddits"."weight" ASC  [["sub_reddit_id", 14]]