app/controllers/related_sub_reddits_controller.rb

SELECT "related_sub_reddits".* FROM "related_sub_reddits"
---
  def index
    @related_sub_reddits = RelatedSubReddit.limit(20).all

DELETE FROM "related_sub_reddits" WHERE "related_sub_reddits"."id" = ?  [["id", 8]]
---
  def destroy
    @related_sub_reddit.destroy

SELECT  "related_sub_reddits".* FROM "related_sub_reddits" WHERE "related_sub_reddits"."id" = ? LIMIT 1  [["id", 12]]
SELECT  "sub_reddits".* FROM "sub_reddits" WHERE "sub_reddits"."id" = ? LIMIT 1  [["id", 24]]
---
  def set_related_sub_reddit
    @related_sub_reddit = RelatedSubReddit.find(params[:id])