app/controllers/sub_reddits_controller.rb

  def index
    @sub_reddits = SubReddit.all
---
SELECT "sub_reddits".* FROM "sub_reddits"

  def create
    @sub_reddit = SubReddit.create(sub_reddit_params)
---
INSERT INTO "related_sub_reddits" ("sub_reddit_id", "sub_reddit_relation_id", "weight", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["sub_reddit_id", 14], ["sub_reddit_relation_id", 13], ["weight", 0.6803717532526112], ["created_at", "2015-06-08 23:56:55.688225"], ["updated_at", "2015-06-08 23:56:55.688225"]]
INSERT INTO "sub_reddits" ("name", "url", "document", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Programming"], ["url", "http://reddit.com/r/programming"], ["document", ""], ["created_at", "2015-06-08 23:44:27.749537"], ["updated_at", "2015-06-08 23:44:27.749537"]]

  def update
    respond_to do |format|
      if @sub_reddit.update(sub_reddit_params)
---
UPDATE "sub_reddits" SET "document" = ?, "bag_of_words" = ?, "updated_at" = ? WHERE "sub_reddits"."id" = ?

  def destroy
    @sub_reddit.destroy
---
DELETE FROM "sub_reddits" WHERE "sub_reddits"."id" = ?  [["id", 1]]

  def set_sub_reddit
    @sub_reddit = SubReddit.find(params[:id])
---
SELECT  "related_sub_reddits".* FROM "related_sub_reddits" WHERE "related_sub_reddits"."sub_reddit_id" = ?  ORDER BY "related_sub_reddits"."id" ASC LIMIT 1  [["sub_reddit_id", 13]]
SELECT  "sub_reddits".* FROM "sub_reddits" WHERE "sub_reddits"."id" = ? LIMIT 1  [["id", 112]]